ТОИР_демо/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ИдентификаторыТехКарт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_ИдентификаторыТехКарт/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДатаПринятия")
		И ЗначениеЗаполнено(Параметры.ДатаПринятия) Тогда
        Список.Параметры.УстановитьЗначениеПараметра("ДатаПринятия", Параметры.ДатаПринятия);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ДатаПринятия", Дата(1,1,1));
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборПоСтатусам") Тогда
		торо_ОбщегоНазначения.УстановитьОтборВСпискеДокументов(Список, "Статус", Параметры.ОтборПоСтатусам, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
		
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьТехКарту(Команда)
	
	Форма = ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаЭлемента", Новый Структура("Родитель", Элементы.Список.ТекущийРодитель), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	
	Форма = ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаГруппы", Новый Структура("ЭтоГруппа, Родитель", Истина, Элементы.Список.ТекущийРодитель), ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекДанные = Неопределено Тогда
		Если ТекДанные.ЭтоГруппа Тогда
			ПоказатьЗначение(Неопределено,ТекДанные.Ссылка);
		Иначе
			ПоказатьЗначение(Неопределено,ТекДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
